const grammarListData = [
  {
    grammar: "〜て初めて",
    meaning: "~서야 비로소",
    form: "て형",
    examples: [
      {
        jp: "外国で生活をしてはじめて、自分の国の良さがわかった。",
        kr: "외국에서 생활을 하고서야 비로소 자국의 좋은 점을 알았다."
      },
      {
        jp: "この計算は、コンピューターの発達によってはじめて可能となった。",
        kr: "이 계산은 컴퓨터의 발달에 의해서 비로소 가능하게 되었다."
      },
      {
        jp: "元気なうちは健康のありがたさに気づかないが、病気になって初めてそれが分かる。平凡な毎日が一番幸せなのだということを、忘れてはならないのだ。",
        kr: "건강할 때는 건강의 고마움을 깨닫지 못하지만, 병이 나고서야 비로소 그것을 알게 된다. 평범한 매일이 가장 행복하다는 것을 잊어서는 안 되는 것이다."
      }
    ]
  },
  {
    grammar: "〜というと・〜といえば",
    meaning: "~라고 하면",
    form: "명사",
    examples: [
      {
        jp: "たんぱく質が多く含まれる食べ物というとお肉と思われがちですが、実は豆腐や納豆にも豊富に含まれています。",
        kr: "단백질이 많이 함유된 음식이라고 하면 고기라고 생각하기 쉽지만, 사실 두부나 낫토에도 풍부하게 함유되어 있습니다."
      },
      {
        jp: "山田さんは旅行というと必ず温泉に行く。",
        kr: "야마다 씨는 여행이라고 하면 반드시 온천에 간다."
      },
      {
        jp: "東洋の絵といえば何といっても自然の姿を描いた山水画が有名だ。",
        kr: "동양의 그림이라고 하면 뭐니뭐니해도 자연의 모습을 그린 산수화가 유명하다."
      }
    ]
  },
  {
    grammar: "AといえばA",
    meaning: "A라면 A하다",
    form: "A 반복",
    examples: [
      {
        jp: "この学校は教授陣も申し分ないが、授業料がかなり高いことが不満といえば不満だ。",
        kr: "이 학교는 교수진도 더할 나위 없지만, 수업료가 상당히 비싼 것이 불만이라면 불만이다."
      }
    ]
  }
];
